<?xml version="1.0"?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="actual_input" type="Parameter" version="opset1">
			<data shape="1,1,96,2000" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="actual_input">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>2000</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_3826" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Subtract_560" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Multiply_3595" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 3, 3" offset="4" size="2304" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Multiply_3430" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_3435" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="2308" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="BatchNormalization_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="128">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="129">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Multiply_3601" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="2564" size="147456" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Multiply_3440" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_3445" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="150020" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="BatchNormalization_4" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="131">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Relu_5" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="132">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="MaxPool_6" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>2000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="133">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Multiply_3607" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 3, 3" offset="150276" size="294912" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Multiply_3450" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_3455" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="445188" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="BatchNormalization_8" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="135">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Relu_9" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="136">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Multiply_3613" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="445700" size="589824" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Multiply_3460" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_3465" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1035524" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="BatchNormalization_11" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="138">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Range_201" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1036036" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="GlobalAveragePool_18" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="145">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Concat_21" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1036052" size="16" />
			<output>
				<port id="0" precision="I64" names="148">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Reshape_22" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="149">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_2263" type="Const" version="opset1">
			<data element_type="f32" shape="16, 128" offset="1036068" size="8192" />
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="MatMul_23" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="151">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Relu_24" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="152">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_2267" type="Const" version="opset1">
			<data element_type="f32" shape="128, 16" offset="1044260" size="8192" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="MatMul_25" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="154">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Sigmoid_26" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="155">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Shape_12" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="139,142,164">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_2178" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1052452" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_2179" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1052468" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="36" name="Gather_2180" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="305" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1052476" size="8" />
			<output>
				<port id="0" precision="I64" names="305">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="306" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1052476" size="8" />
			<output>
				<port id="0" precision="I64" names="306">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Concat_29" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="162">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_30" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="163,165">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Mul_33" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="166">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Multiply_3619" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 1, 1" offset="1052484" size="32768" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Multiply_3467" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_3472" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1085252" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="BatchNormalization_35" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="168">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Add_36" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="169">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Relu_37" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="170">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Multiply_3625" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="1085764" size="589824" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Multiply_3477" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_3482" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1675588" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="BatchNormalization_39" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="172">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Relu_40" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="173">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="MaxPool_41" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>1000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="174">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Multiply_3631" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 3, 3" offset="1676100" size="1179648" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Multiply_3487" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_3492" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="2855748" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="BatchNormalization_43" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="176">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Relu_44" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="177">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Multiply_3637" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 3, 3" offset="2856772" size="2359296" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Multiply_3497" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_3502" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="5216068" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="BatchNormalization_46" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="179">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Range_300" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1036036" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="GlobalAveragePool_53" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="186">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Concat_56" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="5217092" size="16" />
			<output>
				<port id="0" precision="I64" names="189">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_57" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="190">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_2271" type="Const" version="opset1">
			<data element_type="f32" shape="32, 256" offset="5217108" size="32768" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="MatMul_58" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="192">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Relu_59" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="193">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_2275" type="Const" version="opset1">
			<data element_type="f32" shape="256, 32" offset="5249876" size="32768" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="MatMul_60" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="195">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Sigmoid_61" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="196">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Shape_47" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="180,183,205">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_2183" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1052452" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_2184" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1052468" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="76" name="Gather_2185" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="309" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1052476" size="8" />
			<output>
				<port id="0" precision="I64" names="309">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="310" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1052476" size="8" />
			<output>
				<port id="0" precision="I64" names="310">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Concat_64" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="203">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_65" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="204,206">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Mul_68" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="207">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Multiply_3643" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 1, 1" offset="5282644" size="131072" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Multiply_3504" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_3509" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="5413716" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="BatchNormalization_70" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="209">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Add_71" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="210">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Relu_72" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="211">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Multiply_3649" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 3, 3" offset="5414740" size="2359296" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Multiply_3514" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_3519" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="7774036" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="BatchNormalization_74" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="213">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Relu_75" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="214">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="MaxPool_76" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="215">
					<dim>1</dim>
					<dim>256</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>256</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Multiply_3655" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 3, 3" offset="7775060" size="4718592" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Multiply_3524" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_3529" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="12493652" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="BatchNormalization_78" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="217">
					<dim>1</dim>
					<dim>512</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Relu_79" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="218">
					<dim>1</dim>
					<dim>512</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Multiply_3661" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 3, 3" offset="12495700" size="9437184" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Multiply_3534" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_3539" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="21932884" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="BatchNormalization_81" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="220">
					<dim>1</dim>
					<dim>512</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Range_399" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1036036" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="GlobalAveragePool_88" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="227">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Concat_91" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="21934932" size="16" />
			<output>
				<port id="0" precision="I64" names="230">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Reshape_92" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="231">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_2279" type="Const" version="opset1">
			<data element_type="f32" shape="64, 512" offset="21934948" size="131072" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="MatMul_93" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="233">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Relu_94" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="234">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_2283" type="Const" version="opset1">
			<data element_type="f32" shape="512, 64" offset="22066020" size="131072" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="MatMul_95" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="236">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Sigmoid_96" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="237">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Shape_82" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="221,224,246">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_2188" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1052452" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_2189" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1052468" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="116" name="Gather_2190" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="313" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1052476" size="8" />
			<output>
				<port id="0" precision="I64" names="313">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="314" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1052476" size="8" />
			<output>
				<port id="0" precision="I64" names="314">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Concat_99" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="244">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Reshape_100" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="245,247">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Mul_103" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="248">
					<dim>1</dim>
					<dim>512</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Multiply_3667" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 1, 1" offset="22197092" size="524288" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Multiply_3541" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>12</dim>
					<dim>250</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Constant_3546" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="22721380" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
